# # Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# # Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# # Model docs: https://docs.ultralytics.com/models/yolov8
# # Task docs: https://docs.ultralytics.com/tasks/detect

# # Parameters
# nc: 80 # number of classes
# scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
#   s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
#   m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
#   l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
#   x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# # YOLOv8.0n backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#   - [-1, 3, C2f, [128, True]]
#   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
#   - [-1, 6, C2f, [256, True]]
#   - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
#   - [-1, 6, C2f, [512, True]]
#   - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
#   - [-1, 3, C2f, [1024, True]]
#   - [-1, 1, SPPF, [1024, 5]] # 9

# # YOLOv8.0n head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#   - [-1, 3, C2f, [512]] # 12

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#   - [-1, 3, C2f, [256]] # 15 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 12], 1, Concat, [1]] # cat head P4
#   - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 9], 1, Concat, [1]] # cat head P5
#   - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

#   - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)


# Ultralytics YOLOv8 + SwinBlock intégré

# # Nombre de classes
# nc: 1  # à modifier selon ton dataset

# # Échelles de modèle
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone avec SwinBlock inséré après le bloc C2f initial
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
#   - [-1, 3, C2f, [128, True]]            # 2
#   - [-1, 1, SwinBlock, [32]] 
#   #- [-1, 1, SwinBlock, [128]]            # 3 ← ton SwinBlock custom ici
#   - [-1, 1, Conv, [256, 3, 2]]           # 4-P3/8
#   - [-1, 6, C2f, [256, True]]            # 5
#   - [-1, 1, Conv, [512, 3, 2]]           # 6-P4/16
#   - [-1, 6, C2f, [512, True]]            # 7
#   - [-1, 1, Conv, [1024, 3, 2]]          # 8-P5/32
#   - [-1, 3, C2f, [1024, True]]           # 9
#   - [-1, 1, SPPF, [1024, 5]]             # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
#   - [[-1, 6], 1, Concat, [1]]                    # 12
#   - [-1, 3, C2f, [512]]                          # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
#   - [[-1, 4], 1, Concat, [1]]                    # 15
#   - [-1, 3, C2f, [256]]                          # 16

#   - [-1, 1, Conv, [256, 3, 2]]                   # 17
#   - [[-1, 13], 1, Concat, [1]]                   # 18
#   - [-1, 3, C2f, [512]]                          # 19

#   - [-1, 1, Conv, [512, 3, 2]]                   # 20
#   - [[-1, 10], 1, Concat, [1]]                   # 21
#   - [-1, 3, C2f, [1024]]                         # 22

#   - [[16, 19, 22], 1, Detect, [nc]]              # 23


# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv8 avec modules CBAM et SwinBlock dynamiques

# # Parameters
# nc: 1  # number of classes
# scales:  # model compound scaling constants
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # YOLOv8n version
#   s: [0.33, 0.50, 1024]  # YOLOv8s version
#   m: [0.67, 0.75, 768]   # YOLOv8m version
#   l: [1.00, 1.00, 512]   # YOLOv8l version
#   x: [1.00, 1.25, 512]   # YOLOv8x version

# # YOLOv8 backbone avec CBAM et SwinBlock
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1, 3, C2f, [128, True]]  # 2
#   - [-1, 1, CBAM, []]  # 3-CBAM adaptatif
#   - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
#   - [-1, 6, C2f, [256, True]]  # 5
#   - [-1, 1, CBAM, []]  # 6-CBAM adaptatif
#   - [-1, 1, SwinBlock, []]  # 7-SwinBlock adaptatif
#   - [-1, 1, Conv, [512, 3, 2]]  # 8-P4/16
#   - [-1, 6, C2f, [512, True]]  # 9
#   - [-1, 1, CBAM, []]  # 10-CBAM adaptatif
#   - [-1, 1, SwinBlock, []]  # 11-SwinBlock adaptatif
#   - [-1, 1, Conv, [1024, 3, 2]]  # 12-P5/32
#   - [-1, 3, C2f, [1024, True]]  # 13
#   - [-1, 1, CBAM, []]  # 14-CBAM adaptatif
#   - [-1, 1, SPPF, [1024, 5]]  # 15

# # YOLOv8 head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
#   - [[-1, 11], 1, Concat, [1]]  # 17: cat backbone P4
#   - [-1, 3, C2f, [512]]  # 18
#   - [-1, 1, CBAM, []]  # 19-CBAM adaptatif
  
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
#   - [[-1, 6], 1, Concat, [1]]  # 21: cat backbone P3
#   - [-1, 3, C2f, [256]]  # 22
#   - [-1, 1, CBAM, []]  # 23-CBAM adaptatif (P3/8-small)
  
#   - [-1, 1, Conv, [256, 3, 2]]  # 24
#   - [[-1, 19], 1, Concat, [1]]  # 25: cat head P4
#   - [-1, 3, C2f, [512]]  # 26
#   - [-1, 1, CBAM, []]  # 27-CBAM adaptatif (P4/16-medium)
  
#   - [-1, 1, Conv, [512, 3, 2]]  # 28
#   - [[-1, 14], 1, Concat, [1]]  # 29: cat backbone P5
#   - [-1, 3, C2f, [1024]]  # 30
#   - [-1, 1, CBAM, []]  # 31-CBAM adaptatif (P5/32-large)
  
#   - [[23, 27, 31], 1, Detect, [nc]]  # 32: Detect(P3, P4, P5)


# Parameters
# nc: 1  # number of classes
# scales:  # model compound scaling constants
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # YOLOv8n version
#   s: [0.33, 0.50, 1024]  # YOLOv8s version
#   m: [0.67, 0.75, 768]   # YOLOv8m version
#   l: [1.00, 1.00, 512]   # YOLOv8l version
#   x: [1.00, 1.25, 512]   # YOLOv8x version

# # Optimized YOLOv8 backbone with strategic attention modules
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1, 3, C2f, [128, True]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
#   - [-1, 6, C2f, [256, True]]  # 4
#   - [-1, 1, CBAM, []]  # 5-CBAM strategic placement for P3 features
#   - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
#   - [-1, 6, C2f, [512, True]]  # 7
#   - [-1, 1, SwinBlock, []]  # 8-SwinBlock for P4 features (better for medium resolution)
#   - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
#   - [-1, 3, C2f, [1024, True]]  # 10
#   - [-1, 1, CBAM, []]  # 11-CBAM strategic placement for P5 features
#   - [-1, 1, SPPF, [1024, 5]]  # 12

# # YOLOv8 head with selective attention
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
#   - [[-1, 8], 1, Concat, [1]]  # 14: cat backbone P4
#   - [-1, 3, C2f, [512]]  # 15
  
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
#   - [[-1, 5], 1, Concat, [1]]  # 17: cat backbone P3
#   - [-1, 3, C2f, [256]]  # 18
#   - [-1, 1, CBAM, []]  # 19-CBAM only at P3/8-small output
  
#   - [-1, 1, Conv, [256, 3, 2]]  # 20
#   - [[-1, 15], 1, Concat, [1]]  # 21: cat head P4
#   - [-1, 3, C2f, [512]]  # 22
#   - [-1, 1, SwinBlock, []]  # 23-SwinBlock at P4/16-medium output
  
#   - [-1, 1, Conv, [512, 3, 2]]  # 24
#   - [[-1, 11], 1, Concat, [1]]  # 25: cat backbone P5
#   - [-1, 3, C2f, [1024]]  # 26
  
#   - [[19, 23, 26], 1, Detect, [nc]]  # 27: Detect(P3, P4, P5)

# Parameters
# nc: 1  # number of classes
# scales:  # model compound scaling constants
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # YOLOv8n version
#   s: [0.33, 0.50, 1024]  # YOLOv8s version
#   m: [0.67, 0.75, 768]   # YOLOv8m version
#   l: [1.00, 1.00, 512]   # YOLOv8l version
#   x: [1.00, 1.25, 512]   # YOLOv8x version

# # YOLOv8 backbone with minimal enhancements
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1, 3, C2f, [128, True]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
#   - [-1, 6, C2f, [256, True]]  # 4
#   - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
#   - [-1, 6, C2f, [512, True]]  # 6
#   - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
#   - [-1, 3, C2f, [1024, True]]  # 8
#   - [-1, 1, SPPF, [1024, 5]]  # 9
#   - [-1, 1, CBAM, []]  # 10-Single CBAM at highest level feature

# # YOLOv8 head with minimal enhancements
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
#   - [[-1, 6], 1, Concat, [1]]  # 12: cat backbone P4
#   - [-1, 3, C2f, [512]]  # 13
  
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
#   - [[-1, 4], 1, Concat, [1]]  # 15: cat backbone P3
#   - [-1, 3, C2f, [256]]  # 16 (P3/8-small)
  
#   - [-1, 1, Conv, [256, 3, 2]]  # 17
#   - [[-1, 13], 1, Concat, [1]]  # 18: cat head P4
#   - [-1, 3, C2f, [512]]  # 19 (P4/16-medium)
  
#   - [-1, 1, Conv, [512, 3, 2]]  # 20
#   - [[-1, 10], 1, Concat, [1]]  # 21: cat backbone P5
#   - [-1, 3, C2f, [1024]]  # 22 (P5/32-large)
#   - [-1, 1, SwinBlock, []]  # 23-Single SwinBlock at final large feature path
  
#   - [[16, 19, 23], 1, Detect, [nc]]  # 24: Detect(P3, P4, P5)



# YOLOv8 backbone with strategic attention modules
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, CBAM, []]  # 5-CBAM strategic placement for P3 features
  - [-1, 1, SAM, []]  # 6-SAM strategic attention for better spatial feature learning
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 6, C2f, [512, True]]  # 8
  - [-1, 1, SwinBlock, []]  # 9-SwinBlock for P4 features (better for medium resolution)
  - [-1, 1, Conv, [1024, 3, 2]]  # 10-P5/32
  - [-1, 3, C2f, [1024, True]]  # 11
  - [-1, 1, CBAM, []]  # 12-CBAM strategic placement for P5 features
  - [-1, 1, SAM, []]  # 13-SAM strategic attention for improved spatial reasoning
  - [-1, 1, SPPF, [1024, 5]]  # 14

# YOLOv8 head with selective attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 8], 1, Concat, [1]]  # 16: cat backbone P4
  - [-1, 3, C2f, [512]]  # 17
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 5], 1, Concat, [1]]  # 19: cat backbone P3
  - [-1, 3, C2f, [256]]  # 20
  - [-1, 1, CBAM, []]  # 21-CBAM only at P3/8-small output
  - [-1, 1, SAM, []]  # 22-SAM to boost spatial attention for small-scale features
  
  - [-1, 1, Conv, [256, 3, 2]]  # 23
  - [[-1, 15], 1, Concat, [1]]  # 24: cat head P4
  - [-1, 3, C2f, [512]]  # 25
  - [-1, 1, SwinBlock, []]  # 26-SwinBlock at P4/16-medium output
  
  - [-1, 1, Conv, [512, 3, 2]]  # 27
  - [[-1, 11], 1, Concat, [1]]  # 28: cat backbone P5
  - [-1, 3, C2f, [1024]]  # 29
  
  - [[21, 26, 29], 1, Detect, [nc]]  # 30: Detect(P3, P4, P5)
