# # Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# # Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# # Model docs: https://docs.ultralytics.com/models/yolov8
# # Task docs: https://docs.ultralytics.com/tasks/detect

# # Parameters
# nc: 80 # number of classes
# scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
#   s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
#   m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
#   l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
#   x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# # YOLOv8.0n backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#   - [-1, 3, C2f, [128, True]]
#   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
#   - [-1, 6, C2f, [256, True]]
#   - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
#   - [-1, 6, C2f, [512, True]]
#   - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
#   - [-1, 3, C2f, [1024, True]]
#   - [-1, 1, SPPF, [1024, 5]] # 9

# # YOLOv8.0n head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#   - [-1, 3, C2f, [512]] # 12

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#   - [-1, 3, C2f, [256]] # 15 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 12], 1, Concat, [1]] # cat head P4
#   - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 9], 1, Concat, [1]] # cat head P5
#   - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

#   - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)


# Ultralytics YOLOv8 + SwinBlock intégré

# # Nombre de classes
# nc: 1  # à modifier selon ton dataset

# # Échelles de modèle
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone avec SwinBlock inséré après le bloc C2f initial
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
#   - [-1, 3, C2f, [128, True]]            # 2
#   - [-1, 1, SwinBlock, [32]] 
#   #- [-1, 1, SwinBlock, [128]]            # 3 ← ton SwinBlock custom ici
#   - [-1, 1, Conv, [256, 3, 2]]           # 4-P3/8
#   - [-1, 6, C2f, [256, True]]            # 5
#   - [-1, 1, Conv, [512, 3, 2]]           # 6-P4/16
#   - [-1, 6, C2f, [512, True]]            # 7
#   - [-1, 1, Conv, [1024, 3, 2]]          # 8-P5/32
#   - [-1, 3, C2f, [1024, True]]           # 9
#   - [-1, 1, SPPF, [1024, 5]]             # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
#   - [[-1, 6], 1, Concat, [1]]                    # 12
#   - [-1, 3, C2f, [512]]                          # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
#   - [[-1, 4], 1, Concat, [1]]                    # 15
#   - [-1, 3, C2f, [256]]                          # 16

#   - [-1, 1, Conv, [256, 3, 2]]                   # 17
#   - [[-1, 13], 1, Concat, [1]]                   # 18
#   - [-1, 3, C2f, [512]]                          # 19

#   - [-1, 1, Conv, [512, 3, 2]]                   # 20
#   - [[-1, 10], 1, Concat, [1]]                   # 21
#   - [-1, 3, C2f, [1024]]                         # 22

#   - [[16, 19, 22], 1, Detect, [nc]]              # 23


# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv8 avec modules CBAM et SwinBlock dynamiques

# # Parameters
# nc: 1  # number of classes
# scales:  # model compound scaling constants
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # YOLOv8n version
#   s: [0.33, 0.50, 1024]  # YOLOv8s version
#   m: [0.67, 0.75, 768]   # YOLOv8m version
#   l: [1.00, 1.00, 512]   # YOLOv8l version
#   x: [1.00, 1.25, 512]   # YOLOv8x version

# # YOLOv8 backbone avec CBAM et SwinBlock
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1, 3, C2f, [128, True]]  # 2
#   - [-1, 1, CBAM, []]  # 3-CBAM adaptatif
#   - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
#   - [-1, 6, C2f, [256, True]]  # 5
#   - [-1, 1, CBAM, []]  # 6-CBAM adaptatif
#   - [-1, 1, SwinBlock, []]  # 7-SwinBlock adaptatif
#   - [-1, 1, Conv, [512, 3, 2]]  # 8-P4/16
#   - [-1, 6, C2f, [512, True]]  # 9
#   - [-1, 1, CBAM, []]  # 10-CBAM adaptatif
#   - [-1, 1, SwinBlock, []]  # 11-SwinBlock adaptatif
#   - [-1, 1, Conv, [1024, 3, 2]]  # 12-P5/32
#   - [-1, 3, C2f, [1024, True]]  # 13
#   - [-1, 1, CBAM, []]  # 14-CBAM adaptatif
#   - [-1, 1, SPPF, [1024, 5]]  # 15

# # YOLOv8 head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
#   - [[-1, 11], 1, Concat, [1]]  # 17: cat backbone P4
#   - [-1, 3, C2f, [512]]  # 18
#   - [-1, 1, CBAM, []]  # 19-CBAM adaptatif
  
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
#   - [[-1, 6], 1, Concat, [1]]  # 21: cat backbone P3
#   - [-1, 3, C2f, [256]]  # 22
#   - [-1, 1, CBAM, []]  # 23-CBAM adaptatif (P3/8-small)
  
#   - [-1, 1, Conv, [256, 3, 2]]  # 24
#   - [[-1, 19], 1, Concat, [1]]  # 25: cat head P4
#   - [-1, 3, C2f, [512]]  # 26
#   - [-1, 1, CBAM, []]  # 27-CBAM adaptatif (P4/16-medium)
  
#   - [-1, 1, Conv, [512, 3, 2]]  # 28
#   - [[-1, 14], 1, Concat, [1]]  # 29: cat backbone P5
#   - [-1, 3, C2f, [1024]]  # 30
#   - [-1, 1, CBAM, []]  # 31-CBAM adaptatif (P5/32-large)
  
#   - [[23, 27, 31], 1, Detect, [nc]]  # 32: Detect(P3, P4, P5)


# Parameters
# nc: 1  # number of classes
# scales:  # model compound scaling constants
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # YOLOv8n version
#   s: [0.33, 0.50, 1024]  # YOLOv8s version
#   m: [0.67, 0.75, 768]   # YOLOv8m version
#   l: [1.00, 1.00, 512]   # YOLOv8l version
#   x: [1.00, 1.25, 512]   # YOLOv8x version

# # Optimized YOLOv8 backbone with strategic attention modules
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1, 3, C2f, [128, True]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
#   - [-1, 6, C2f, [256, True]]  # 4
#   - [-1, 1, CBAM, []]  # 5-CBAM strategic placement for P3 features
#   - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
#   - [-1, 6, C2f, [512, True]]  # 7
#   - [-1, 1, SwinBlock, []]  # 8-SwinBlock for P4 features (better for medium resolution)
#   - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
#   - [-1, 3, C2f, [1024, True]]  # 10
#   - [-1, 1, CBAM, []]  # 11-CBAM strategic placement for P5 features
#   - [-1, 1, SPPF, [1024, 5]]  # 12

# # YOLOv8 head with selective attention
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
#   - [[-1, 8], 1, Concat, [1]]  # 14: cat backbone P4
#   - [-1, 3, C2f, [512]]  # 15
  
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
#   - [[-1, 5], 1, Concat, [1]]  # 17: cat backbone P3
#   - [-1, 3, C2f, [256]]  # 18
#   - [-1, 1, CBAM, []]  # 19-CBAM only at P3/8-small output
  
#   - [-1, 1, Conv, [256, 3, 2]]  # 20
#   - [[-1, 15], 1, Concat, [1]]  # 21: cat head P4
#   - [-1, 3, C2f, [512]]  # 22
#   - [-1, 1, SwinBlock, []]  # 23-SwinBlock at P4/16-medium output
  
#   - [-1, 1, Conv, [512, 3, 2]]  # 24
#   - [[-1, 11], 1, Concat, [1]]  # 25: cat backbone P5
#   - [-1, 3, C2f, [1024]]  # 26
  
#   - [[19, 23, 26], 1, Detect, [nc]]  # 27: Detect(P3, P4, P5)

# Parameters
# nc: 1  # number of classes
# scales:  # model compound scaling constants
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # YOLOv8n version
#   s: [0.33, 0.50, 1024]  # YOLOv8s version
#   m: [0.67, 0.75, 768]   # YOLOv8m version
#   l: [1.00, 1.00, 512]   # YOLOv8l version
#   x: [1.00, 1.25, 512]   # YOLOv8x version

# # YOLOv8 backbone with minimal enhancements
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1, 3, C2f, [128, True]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
#   - [-1, 6, C2f, [256, True]]  # 4
#   - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
#   - [-1, 6, C2f, [512, True]]  # 6
#   - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
#   - [-1, 3, C2f, [1024, True]]  # 8
#   - [-1, 1, SPPF, [1024, 5]]  # 9
#   - [-1, 1, CBAM, []]  # 10-Single CBAM at highest level feature

# # YOLOv8 head with minimal enhancements
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
#   - [[-1, 6], 1, Concat, [1]]  # 12: cat backbone P4
#   - [-1, 3, C2f, [512]]  # 13
  
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
#   - [[-1, 4], 1, Concat, [1]]  # 15: cat backbone P3
#   - [-1, 3, C2f, [256]]  # 16 (P3/8-small)
  
#   - [-1, 1, Conv, [256, 3, 2]]  # 17
#   - [[-1, 13], 1, Concat, [1]]  # 18: cat head P4
#   - [-1, 3, C2f, [512]]  # 19 (P4/16-medium)
  
#   - [-1, 1, Conv, [512, 3, 2]]  # 20
#   - [[-1, 10], 1, Concat, [1]]  # 21: cat backbone P5
#   - [-1, 3, C2f, [1024]]  # 22 (P5/32-large)
#   - [-1, 1, SwinBlock, []]  # 23-Single SwinBlock at final large feature path
  
#   - [[16, 19, 23], 1, Detect, [nc]]  # 24: Detect(P3, P4, P5)



# Tumor-Detection YOLOv8n Custom Model
# Classes
# nc: 1  # 1 class (tumor)

# # Model scaling
# scales:
#   n: [0.33, 0.25, 1024]  # nano
#   s: [0.33, 0.50, 1024]  # small
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1 - P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3 - P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, ECBAM, [256]]             # 5 - Apply ECBAM after enough feature learning (P3)

#   - [-1, 1, Conv, [512, 3, 2]]        # 6 - P4/16
#   - [-1, 6, C2f, [512, True]]         # 7
#   - [-1, 1, SwinBlock, []]            # 8 - Transformer block after C2f
#   - [-1, 1, ECBAM, [512]]             # 9 - After more complex features (P4)

#   - [-1, 1, Conv, [768, 3, 2]]        # 10 - P5/32
#   - [-1, 3, C2f, [768, True]]         # 11
#   - [-1, 1, SPPF, [768, 5]]           # 12 - Final pooling layer

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
#   - [[-1, 7], 1, Concat, [1]]                  # 14
#   - [-1, 3, C2f, [512]]                         # 15

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
#   - [[-1, 4], 1, Concat, [1]]                  # 17
#   - [-1, 3, C2f, [256]]                         # 18
#   - [-1, 1, ECBAM, [256]]                       # 19 - ECBAM after aggregation at P3 head

#   - [-1, 1, Conv, [256, 3, 2]]                  # 20
#   - [[-1, 15], 1, Concat, [1]]                  # 21
#   - [-1, 3, C2f, [512]]                         # 22

#   - [-1, 1, Conv, [512, 3, 2]]                  # 23
#   - [[-1, 11], 1, Concat, [1]]                  # 24
#   - [-1, 3, C2f, [768]]                         # 25
#   - [-1, 1, ECBAM, [768]]                       # 26 - Final ECBAM at P5 head

#   - [[19, 22, 26], 1, Detect, [nc]]             # 27



# Tumor-Detection YOLOv8n Upgraded (with >768 channels at P5)
# Parameters
# 

# Parameters
# nc: 1  # number of classes
# scales:
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # nano
#   m: [0.67, 0.75, 768]   # Recommend using at least m size for larger dataset

# # Optimized backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1, 3, C2f, [128, True]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
#   - [-1, 6, C2f, [256, True]]  # 4
#   - [-1, 1, CBAM, []]  # 5-CBAM for P3 features
#   - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
#   - [-1, 6, C2f, [512, True]]  # 7
#   - [-1, 1, SwinBlock, []]  # 8-SwinBlock for P4
#   - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
#   - [-1, 3, C2f, [1024, True]]  # 10
#   - [-1, 1, SPPF, [1024, 5]]  # 11-Replace CBAM with SPPF here
#   - [-1, 1, CBAM, []]  # 12-CBAM after SPPF

# # Enhanced head with better feature integration
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
#   - [[-1, 8], 1, Concat, [1]]  # 14: cat backbone P4
#   - [-1, 3, C2f, [512]]  # 15
#   - [-1, 1, C2f, [512]]  # 16: Extra C2f for better feature processing
  
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
#   - [[-1, 5], 1, Concat, [1]]  # 18: cat backbone P3
#   - [-1, 3, C2f, [256]]  # 19
#   - [-1, 1, SwinBlock, []]  # 20: SwinBlock for small objects
  
#   - [-1, 1, Conv, [256, 3, 2]]  # 21
#   - [[-1, 16], 1, Concat, [1]]  # 22: cat head P4
#   - [-1, 3, C2f, [512]]  # 23
#   - [-1, 1, CBAM, []]  # 24: CBAM for medium objects
  
#   - [-1, 1, Conv, [512, 3, 2]]  # 25
#   - [[-1, 12], 1, Concat, [1]]  # 26: cat backbone P5
#   - [-1, 3, C2f, [1024]]  # 27
#   - [-1, 1, SwinBlock, []]  # 28: SwinBlock for large objects
  
#   - [[20, 24, 28], 1, Detect, [nc]]  # 29: Detect(P3, P4, P5)


#================================================


# YOLOv8-Medical Optimized YAML

# Parameters
# nc: 1  # number of classes (adjust if needed)
# scales:
#   m: [0.67, 0.75, 768]  # Base YOLOv8m scaling

# # Backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
#   - [-1, 3, C2f, [128, True]]      # 2
#   - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
#   - [-1, 6, C2f, [256, True]]      # 4
#   - [-1, 1, CBAM, []]              # 5 - CBAM after P3
#   - [-1, 1, Conv, [512, 3, 2]]     # 6-P4/16
#   - [-1, 6, C2f, [512, True]]      # 7
#   - [-1, 1, SwinBlock, []]         # 8 - Swin Transformer Block after P4
#   - [-1, 1, Conv, [768, 3, 2]]     # 9-P5/32
#   - [-1, 3, C2f, [768, True]]      # 10
#   - [-1, 1, CBAM, []]              # 11 - CBAM after P5
#   - [-1, 1, SPPF, [768, 5]]        # 12 - Spatial Pyramid Pooling

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
#   - [[-1, 8], 1, Concat, [1]]                   # 14: P4
#   - [-1, 3, C2f, [512]]                         # 15

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
#   - [[-1, 5], 1, Concat, [1]]                   # 17: P3
#   - [-1, 3, C2f, [256]]                         # 18
#   - [-1, 1, CBAM, []]                           # 19 - CBAM at small objects (P3)

#   - [-1, 1, Conv, [256, 3, 2]]                  # 20
#   - [[-1, 15], 1, Concat, [1]]                  # 21: merge P4
#   - [-1, 3, C2f, [512]]                         # 22
#   - [-1, 1, SwinBlock, []]                      # 23 - SwinBlock at P4 fusion

#   - [-1, 1, Conv, [512, 3, 2]]                  # 24
#   - [[-1, 11], 1, Concat, [1]]                  # 25: merge P5
#   - [-1, 3, C2f, [768]]                         # 26

#   - [[19, 23, 26], 1, Detect, [nc]]             # 27 - Final detection head

#================================================================
# nc: 1  # number of classes
# scales:
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # nano
#   m: [0.67, 0.75, 768]   # Recommend using at least m size for larger dataset

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # P2/4
#   - [-1, 3, C2f, [128, True]]         # C2f block
#   - [-1, 1, Conv, [256, 3, 2]]        # P3/8
#   - [-1, 6, C2f, [256, True]]         # C2f block
#   - [-1, 1, Conv, [512, 3, 2]]        # P4/16
#   - [-1, 6, C2f, [512, True]]         # C2f block
#  # - [-1, 1, SwinBlock, [128]]         # SwinBlock (assuming 512 channels)
#   - [-1, 1, SwinBlock, [384]]  # match scaled output of previous layer for m 3la hka bdlt 

#   - [-1, 1, Conv, [1024, 3, 2]]       # P5/32
#   - [-1, 3, C2f, [1024, True]]        # C2f block
#   - [-1, 1, SPPF, [1024, 5]]          # SPPF (kernel=5)

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]]     # cat backbone P4
#   - [-1, 3, C2f, [512]]           # head for medium objects
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]]     # cat backbone P3
#   - [-1, 4, C2f, [256]]           # head for small objects (increased depth)
#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 12], 1, Concat, [1]]    # cat features for medium head
#   - [-1, 4, C2f, [512]]           # head for medium objects (increased depth)
#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 9], 1, Concat, [1]]     # cat features for large head
#   - [-1, 3, C2f, [1024]]          # head for large objects
#   - [[15, 18, 21], 1, Detect, [nc]]
#=======================================================

# yolov8n-swin.yaml
# Ultralytics YOLOv8n avec SwinBlock ajouté

# nc: 1  # nombre de classes
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # backbone:
# #   - [-1, 1, Conv, [64, 3, 2]]
# #   - [-1, 1, Conv, [128, 3, 2]]
# #   - [-1, 1, SwinBlock, [32]]  # dim=32
# #   - [-1, 3, C2f, [128, True]]
# #   - [-1, 1, Conv, [256, 3, 2]]
# #   - [-1, 3, C2f, [256, True]]       # réduit
# #   - [-1, 1, Conv, [512, 3, 2]]
# #   - [-1, 4, C2f, [512, True]]       # réduit
# #   - [-1, 1, Conv, [1024, 3, 2]]
# #   - [-1, 3, C2f, [1024, True]]
# #   - [-1, 1, Conv, [1024, 1, 1]]      # SPPF supprimé, remplacé

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
#   - [-1, 1, SwinBlock, [32]]           # 2-Swin
#   - [-1, 8, C2f, [128, True]]          # 3 (Remplacement par 8)
#   - [-1, 1, Conv, [256, 3, 2]]         # 4-P3/8
#   - [-1, 8, C2f, [256, True]]          # 5 - réduit (Remplacement par 8)
#   - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
#   - [-1, 8, C2f, [512, True]]          # 7 - réduit (Remplacement par 8)
#   - [-1, 1, Conv, [1024, 3, 2]]        # 8-P5/32
#   - [-1, 8, C2f, [1024, True]]         # 9 (Remplacement par 8)
#   - [-1, 1, SPPF, [1024, 5]]           # 10-Similar to original YOLOv8

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsampling 1st layer
#   - [[-1, 7], 1, Concat, [1]]  # Concatenate with layer 7 (8th layer in backbone)
#   - [-1, 2, C2f, [512]]  # Reduce dimensions
  
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsampling 2nd layer
#   - [[-1, 5], 1, Concat, [1]]  # Concatenate with layer 5 (8th layer in backbone)
#   - [-1, 2, C2f, [256]]  # Reduce dimensions
  
#   - [-1, 1, Conv, [256, 3, 2]]  # Convolution layer
#   - [[-1, 13], 1, Concat, [1]]  # Concatenate with layer 13 (upscaled layer)
#   - [-1, 2, C2f, [512]]  # Reduce dimensions
  
#   - [-1, 1, Conv, [512, 3, 2]]  # Convolution layer
#   - [[-1, 10], 1, Concat, [1]]  # Concatenate with layer 10 (upscaled layer)
#   - [-1, 2, C2f, [1024]]  # Reduce dimensions

#   - [[16, 19, 22], 1, Detect, [nc]]  # Detect layer (final output)


#========================
  # Parameters
# nc: 1  # number of classes
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone with SwinBlock and CBAM (only in backbone)
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, CBAM, []]                 # 5 - CBAM at P3
#   - [-1, 1, Conv, [512, 3, 2]]        # 6-P4/16
#   - [-1, 6, C2f, [512, True]]         # 7
#   - [-1, 1, SwinBlock, [128]]         # 8 - SwinBlock with dim=512
#   - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 10
#   - [-1, 1, CBAM, []]                 # 11 - CBAM at P5
#   - [-1, 1, SPPF, [1024, 5]]          # 12

# # Head without CBAM or SwinBlock
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13
#   - [[-1, 8], 1, Concat, [1]]                     # 14
#   - [-1, 3, C2f, [512]]                           # 15

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
#   - [[-1, 5], 1, Concat, [1]]                     # 17
#   - [-1, 3, C2f, [256]]                           # 18

#   - [-1, 1, Conv, [256, 3, 2]]                    # 19
#   - [[-1, 15], 1, Concat, [1]]                    # 20
#   - [-1, 3, C2f, [512]]                           # 21

#   - [-1, 1, Conv, [512, 3, 2]]                    # 22
#   - [[-1, 11], 1, Concat, [1]]                    # 23
#   - [-1, 3, C2f, [1024]]                          # 24

#   - [[18, 21, 24], 1, Detect, [nc]]              # 25: Detect(P3, P4, P5)

#==============
# nc: 1  # number of classes
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone without CBAM (removed CBAM at index 5)
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C2f, [512, True]]         # 6
#   - [-1, 1, SwinBlock, [128]]         # 7
#   - [-1, 1, Conv, [1024, 3, 2]]       # 8-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 9
#   - [-1, 1, CBAM, []]                 # 10 - CBAM at P5 (toujours présent)
#   - [-1, 1, SPPF, [1024, 5]]          # 11

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
#   - [[-1, 7], 1, Concat, [1]]                     # 13 (8 -> 7)
#   - [-1, 3, C2f, [512]]                           # 14

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 15
#   - [[-1, 4], 1, Concat, [1]]                     # 16 (5 -> 4)
#   - [-1, 3, C2f, [256]]                           # 17

#   - [-1, 1, Conv, [256, 3, 2]]                    # 18
#   - [[-1, 14], 1, Concat, [1]]                    # 19 (15 -> 14)
#   - [-1, 3, C2f, [512]]                           # 20

#   - [-1, 1, Conv, [512, 3, 2]]                    # 21
#   - [[-1, 10], 1, Concat, [1]]                    # 22 (11 -> 10)
#   - [-1, 3, C2f, [1024]]                          # 23

#   - [[17, 20, 23], 1, Detect, [nc]]              # 24
#=================================
# nc: 1  # number of classes
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone without CBAM (removed CBAM at index 5)
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C2f, [512, True]]         # 6
#   - [-1, 1, SwinBlock, [128]]         # 7
#   - [-1, 1, Conv, [1024, 3, 2]]       # 8-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 9
#   - [-1, 1, CBAM, []]                 # 10 - CBAM at P5 (toujours présent)
#   - [-1, 1, SPPF, [1024, 5]]          # 11
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
#   - [[-1, 7], 1, Concat, [1]]                     # 13 (8 -> 7)
#   - [-1, 3, C2f, [512]]                           # 14
#   - [-1, 1, SwinBlock, [128]]                     # 15 <-- SwinBlock ajouté ici

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
#   - [[-1, 4], 1, Concat, [1]]                     # 17 (5 -> 4)
#   - [-1, 3, C2f, [256]]                           # 18

#   - [-1, 1, Conv, [256, 3, 2]]                    # 19
#   - [[-1, 15], 1, Concat, [1]]                    # 20 (16 -> 15)
#   - [-1, 3, C2f, [512]]                           # 21

#   - [-1, 1, Conv, [512, 3, 2]]                    # 22
#   - [[-1, 10], 1, Concat, [1]]                    # 23 (11 -> 10)
#   - [-1, 3, C2f, [1024]]                          # 24

#   - [[18, 21, 24], 1, Detect, [nc]]              # 25


#=====================================================


# 

#======================it is =====

#=================================
# nc: 1  # number of classes
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]


# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C2f, [512, True]]         # 6
#   - [-1, 1, SwinBlock, [384]]         # 7 128 nano 265 small 384 mediem 512 large
#   - [-1, 1, Conv, [1024, 3, 2]]       # 8-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 9
#   - [-1, 1, CBAM, []]                 # 10 - CBAM at P5 
#   - [-1, 1, SPPF, [1024, 5]]          # 11
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
#   - [[-1, 7], 1, Concat, [1]]                     # 13 (8 -> 7)
#   - [-1, 3, C2f, [512]]                           # 14
#   - [-1, 1, SwinBlock, [384]]                     # 15 <-- SwinBlock ajouté ici

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
#   - [[-1, 4], 1, Concat, [1]]                     # 17 (5 -> 4)
#   - [-1, 3, C2f, [256]]                           # 18

#   - [-1, 1, Conv, [256, 3, 2]]                    # 19
#   - [[-1, 15], 1, Concat, [1]]                    # 20 (16 -> 15)
#   - [-1, 3, C2f, [512]]                           # 21

#   - [-1, 1, Conv, [512, 3, 2]]                    # 22
#   - [[-1, 10], 1, Concat, [1]]                    # 23 (11 -> 10)
#   - [-1, 3, C2f, [1024]]                          # 24

#   - [[18, 21, 24], 1, Detect, [nc]]              # 25

#=====================================================Add another SPPF (this one give map 82.5) )
# nc: 1  # number of classes
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
#   - [-1, 3, C2f, [128, True]]          # 2
#   - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
#   - [-1, 6, C2f, [256, True]]          # 4
#   - [-1, 1, Conv, [512, 3, 2]]         # 5 - P4/16
#   - [-1, 6, C2f, [512, True]]          # 6
#   - [-1, 1, SwinBlock, [384]]          # 7
#   - [-1, 1, Conv, [1024, 3, 2]]        # 8 - P5/32
#   - [-1, 3, C2f, [1024, True]]         # 9
#   - [-1, 1, CBAM, []]                  # 10 - CBAM at P5
#   - [-1, 1, SPPF, [1024, 5]]           # 11 - First SPPF
#   - [-1, 1, SPPF, [1024, 5]]           # 12 - Second SPPF added here

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13
#   - [[-1, 7], 1, Concat, [1]]                     # 14 (8 -> 7)
#   - [-1, 3, C2f, [512]]                           # 15
#   - [-1, 1, SwinBlock, [384]]                     # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 17
#   - [[-1, 4], 1, Concat, [1]]                     # 18 (5 -> 4)
#   - [-1, 3, C2f, [256]]                           # 19

#   - [-1, 1, Conv, [256, 3, 2]]                    # 20
#   - [[-1, 16], 1, Concat, [1]]                    # 21 (17 -> 16)
#   - [-1, 3, C2f, [512]]                           # 22

#   - [-1, 1, Conv, [512, 3, 2]]                    # 23
#   - [[-1, 10], 1, Concat, [1]]                    # 24 (12 -> 10)
#   - [-1, 3, C2f, [1024]]                          # 25

#   - [[19, 22, 25], 1, Detect, [nc]]              # 26
#========================SPPF NEW 777=================================

# nc: 1  # number of classes

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
#   - [-1, 3, C2f, [128, True]]          # 2
#   - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
#   - [-1, 6, C2f, [256, True]]          # 4
#   - [-1, 1, Conv, [512, 3, 2]]         # 5 - P4/16
#   - [-1, 6, C2f, [512, True]]          # 6
#   - [-1, 1, SwinBlock, [384]]          # 7
#   - [-1, 1, Conv, [1024, 3, 2]]        # 8 - P5/32
#   - [-1, 3, C2f, [1024, True]]         # 9
#   - [-1, 1, CBAM, []]                  # 10 - CBAM at P5
#   - [-1, 1, SPPF, [1024, 5]]           # 11 - First SPPF
#   - [-1, 1, SPPF, [1024, 7]]           # 12 - Second SPPF 

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13
#   - [[-1, 7], 1, Concat, [1]]                     # 14 
#   - [-1, 3, C2f, [512]]                           # 15
#   - [-1, 1, SwinBlock, [384]]                     # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 17
#   - [[-1, 4], 1, Concat, [1]]                     # 18 
#   - [-1, 3, C2f, [256]]                           # 19

#   - [-1, 1, Conv, [256, 3, 2]]                    # 20
#   - [[-1, 16], 1, Concat, [1]]                    # 21 
#   - [-1, 3, C2f, [512]]                           # 22

#   - [-1, 1, Conv, [512, 3, 2]]                    # 23
#   - [[-1, 10], 1, Concat, [1]]                    # 24 
#   - [-1, 3, C2f, [1024]]                          # 25

#   - [[19, 22, 25], 1, Detect, [nc]]              # 26


#######===================================================#########
nc: 1  # number of classes

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
  - [-1, 6, C2f, [256, True]]          # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5 - P4/16
  - [-1, 6, C2f, [512, True]]          # 6
  - [-1, 1, SwinBlock, [384]]          # 7
  - [-1, 1, Conv, [1024, 3, 2]]        # 8 - P5/32
  - [-1, 3, C2f, [1024, True]]         # 9
  - [-1, 1, CBAM, []]                  # 10 - CBAM at P5
  - [-1, 1, SPPF, [1024, 5]]           # 11 - First SPPF
  - [-1, 1, CBAM, []]                  # 10 - CBAM at P5
  - [-1, 1, SPPF, [1024, 7]]           # 12 - Second SPPF 


head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13
  - [[-1, 7], 1, Concat, [1]]                     # 14 
  - [-1, 3, C2f, [512]]                           # 15
  - [-1, 1, SwinBlock, [384]]                     # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 17
  - [[-1, 4], 1, Concat, [1]]                     # 18 
  - [-1, 3, C2f, [256]]                           # 19

  - [-1, 1, Conv, [256, 3, 2]]                    # 20
  - [[-1, 16], 1, Concat, [1]]                    # 21 
  - [-1, 3, C2f, [512]]                           # 22

  - [-1, 1, Conv, [512, 3, 2]]                    # 23
  - [[-1, 10], 1, Concat, [1]]                    # 24 
  - [-1, 3, C2f, [1024]]                          # 25

  - [[19, 22, 25], 1, Detect, [nc]]              # 26

#######===================================================#########


#=====================================================with C3 
# nc: 1  # number of classes
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C3, [128, True]]          # 2 (Changed from C2f to C3)
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C3, [256, True]]          # 4 (Changed from C2f to C3)
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C3, [512, True]]          # 6 (Changed from C2f to C3)
#   - [-1, 1, SwinBlock, [384]]         # 7
#   - [-1, 1, Conv, [1024, 3, 2]]       # 8-P5/32
#   - [-1, 3, C3, [1024, True]]         # 9 (Changed from C2f to C3)
#   - [-1, 1, CBAM, []]                 # 10 - CBAM at P5 
#   - [-1, 1, SPPF, [1024, 5]]          # 11

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
#   - [[-1, 7], 1, Concat, [1]]                     # 13
#   - [-1, 3, C3, [512]]                            # 14 (Changed from C2f to C3)
#   - [-1, 1, SwinBlock, [384]]                     # 15

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
#   - [[-1, 4], 1, Concat, [1]]                     # 17
#   - [-1, 3, C3, [256]]                            # 18 (Changed from C2f to C3)

#   - [-1, 1, Conv, [256, 3, 2]]                    # 19
#   - [[-1, 15], 1, Concat, [1]]                    # 20
#   - [-1, 3, C3, [512]]                            # 21 (Changed from C2f to C3)

#   - [-1, 1, Conv, [512, 3, 2]]                    # 22
#   - [[-1, 10], 1, Concat, [1]]                    # 23
#   - [-1, 3, C3, [1024]]                           # 24 (Changed from C2f to C3)

#   - [[18, 21, 24], 1, Detect, [nc]]               # 25

#=====================================================     with ASP


#=====================================================      

# nc: 1  # number of classes

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, CBAM, []]                 # 5 - CBAM after layer 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 6-P4/16
#   - [-1, 6, C2f, [512, True]]         # 7
#   - [-1, 1, SPPF, [512, 5]]           # 8 - Extra SPPF before P5
#   - [-1, 1, SwinBlock, [128]]         # 9
#   - [-1, 1, Conv, [1024, 3, 2]]       # 10-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 11
#   - [-1, 1, CBAM, []]                 # 12 - CBAM at P5
#   - [-1, 1, SPPF, [1024, 5]]          # 13

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 14
#   - [[-1, 9], 1, Concat, [1]]                     # 15
#   - [-1, 3, C2f, [512]]                           # 16
#   - [-1, 2, SwinBlock, [128]]                     # 17 - deeper Swin
#   - [-1, 1, Conv, [256, 1, 1]]                    # 18 - post-Swin compression

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 19
#   - [[-1, 5], 1, Concat, [1]]                     # 20
#   - [-1, 3, C2f, [256]]                           # 21

#   - [-1, 1, Conv, [256, 3, 2]]                    # 22
#   - [[-1, 18], 1, Concat, [1]]                    # 23
#   - [-1, 3, C2f, [512]]                           # 24

#   - [-1, 1, Conv, [512, 3, 2]]                    # 25
#   - [[-1, 12], 1, Concat, [1]]                    # 26
#   - [-1, 3, C2f, [1024]]                          # 27

#   - [[21, 24, 27], 1, Detect, [nc]]              # 28

# =====================================================
#=====================================================

# nc: 1  # Nombre de classes

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# backbone:
#   # [from, number, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]          # 0
#   - [-1, 1, Conv, [128, 3, 2]]         # 1
#   - [-1, 3, C2f, [128, True]]          # 2
#   - [-1, 1, Conv, [256, 3, 2]]         # 3
#   - [-1, 6, C2f, [256, True]]          # 4
#   - [-1, 1, CBAM, []]                  # 5 ← P3 (80x80)
#   - [-1, 1, Conv, [512, 3, 2]]         # 6
#   - [-1, 6, C2f, [512, True]]          # 7
#   - [-1, 1, SPPF, [512, 5]]            # 8
#   - [-1, 1, SwinBlock, [128]]          # 9
#   - [-1, 1, Conv, [1024, 3, 2]]        # 10
#   - [-1, 3, C2f, [1024, True]]         # 11
#   - [-1, 1, CBAM, []]                  # 12 ← P5 (20x20)
#   - [-1, 1, SPPF, [1024, 5]]           # 13

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14 → up to 40x40
#   - [[-1, 9], 1, Concat, [1]]                  # 15 ← merge SwinBlock (40x40)
#   - [-1, 3, C2f, [512]]                        # 16
#   - [-1, 1, Conv, [256, 1, 1]]                 # 17
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18 → up to 80x80
#   - [[-1, 5], 1, Concat, [1]]                  # 19 ← CBAM P3 (80x80)
#   - [-1, 3, C2f, [256]]                        # 20

#   - [-1, 1, Conv, [256, 3, 2]]                 # 21 → down to 40x40
#   - [[-1, 17], 1, Concat, [1]]                 # 22
#   - [-1, 3, C2f, [512]]                        # 23

#   - [-1, 1, Conv, [512, 3, 2]]                 # 24 → down to 20x20
#   - [[-1, 13], 1, Concat, [1]]                 # 25 ← SPPF final
#   - [-1, 3, C2f, [1024]]                       # 26

#   - [[20, 23, 26], 1, Detect, [nc]]            # 27 ← P3 (80x80), P4 (40x40), P5 (20x20)



#============Ajoutswindanshead

#number of classes
# nc: 1

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone without CBAM (removed CBAM at index 5)
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C2f, [512, True]]         # 6
#   - [-1, 1, SwinBlock, [128]]         # 7
#   - [-1, 1, Conv, [1024, 3, 2]]       # 8-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 9
#   - [-1, 1, CBAM, []]                 # 10 - CBAM at P5
#   - [-1, 1, SPPF, [1024, 5]]          # 11

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
#   - [[-1, 7], 1, Concat, [1]]                     # 13
#   - [-1, 3, C2f, [512]]                           # 14
#   - [-1, 1, SwinBlock, [128]]                     # 15 (1er SwinBlock ajouté)

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
#   - [[-1, 4], 1, Concat, [1]]                     # 17
#   - [-1, 3, C2f, [256]]                           # 18
#   - [-1, 1, SwinBlock, [64]]                     # 19 (2e SwinBlock ajouté)

#   - [-1, 1, Conv, [256, 3, 2]]                    # 20
#   - [[-1, 15], 1, Concat, [1]]                    # 21
#   - [-1, 3, C2f, [512]]                           # 22

#   - [-1, 1, Conv, [512, 3, 2]]                    # 23
#   - [[-1, 10], 1, Concat, [1]]                    # 24
#   - [-1, 3, C2f, [1024]]                          # 25

#   - [[19, 22, 25], 1, Detect, [nc]]              # 26




#                 ==============================

# nc: 1  # Nombre de classes

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# backbone:
#   # [from, number, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]          # 0
#   - [-1, 1, Conv, [128, 3, 2]]         # 1
#   - [-1, 3, C2f, [128, True]]          # 2
#   - [-1, 1, Conv, [256, 3, 2]]         # 3
#   - [-1, 6, C2f, [256, True]]          # 4
#   - [-1, 1, CBAM, []]                  # 5 ← P3 (80x80)
#   - [-1, 1, Conv, [512, 3, 2]]         # 6
#   - [-1, 6, C2f, [512, True]]          # 7
#   - [-1, 1, SPPF, [512, 5]]            # 8
#   - [-1, 1, SwinBlock, [128]]          # 9
#   - [-1, 1, Conv, [1024, 3, 2]]        # 10
#   - [-1, 3, C2f, [1024, True]]         # 11
#   - [-1, 1, CBAM, []]                  # 12 ← P5 (20x20)
#   - [-1, 1, SPPF, [1024, 5]]           # 13

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14 → up to 40x40
#   - [[-1, 9], 1, Concat, [1]]                  # 15 ← merge SwinBlock (40x40)
#   - [-1, 3, C2f, [512]]                        # 16
#   - [-1, 1, Conv, [256, 1, 1]]                 # 17
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18 → up to 80x80
#   - [[-1, 5], 1, Concat, [1]]                  # 19 ← CBAM P3 (80x80)
#   - [-1, 3, C2f, [256]]                        # 20

#   - [-1, 1, Conv, [256, 3, 2]]                 # 21 → down to 40x40
#   - [[-1, 17], 1, Concat, [1]]                 # 22
#   - [-1, 3, C2f, [512]]                        # 23

#   - [-1, 1, Conv, [512, 3, 2]]                 # 24 → down to 20x20
#   - [[-1, 13], 1, Concat, [1]]                 # 25 ← SPPF final
#   - [-1, 3, C2f, [1024]]                       # 26

#   - [[20, 23, 26], 1, Detect, [nc]]            # 27 ← P3 (80x80), P4 (40x40), P5 (20x20)


#=====================================================

# Model Configuration

# nc: 1  # Number of classes

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone with added CBAM at P4
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C2f, [512, True]]         # 6
#   - [-1, 1, CBAM, []]                 # 7 - CBAM after P4
#   - [-1, 1, SwinBlock, [128]]         # 8 - SwinBlock with 512 channels
#   - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 10
#   - [-1, 1, CBAM, []]                 # 11 - CBAM at P5
#   - [-1, 1, SPPF, [1024, 5]]          # 12

# # Head configuration
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13
#   - [[-1, 8], 1, Concat, [1]]                     # 14
#   - [-1, 3, C2f, [512]]                           # 15
#   - [-1, 1, SwinBlock, [128]]                     # 16 - Ensure 512 channels for SwinBlock

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 17
#   - [[-1, 4], 1, Concat, [1]]                     # 18
#   - [-1, 3, C2f, [256]]                           # 19
#   - [-1, 1, SwinBlock, [64]]                     # 20 - SwinBlock with 256 channels

#   - [-1, 1, Conv, [256, 3, 2]]                    # 21
#   - [[-1, 16], 1, Concat, [1]]                    # 22
#   - [-1, 3, C2f, [128]]                           # 23

#   - [-1, 1, Conv, [512, 3, 2]]                    # 24
#   - [[-1, 11], 1, Concat, [1]]                    # 25
#   - [-1, 3, C2f, [1024]]                          # 26

#   - [[20, 23, 26], 1, Detect, [nc]]              # 27 - Detection head

#===========================================================================


# nc: 1  # Number of classes

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone with CBAM only at P4
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C2f, [512, True]]         # 6
#   - [-1, 1, CBAM, []]                 # 7 - CBAM after P4
#   - [-1, 1, SwinBlock, [128]]         # 8 - SwinBlock with 512 channels
#   - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 10
#   - [-1, 1, SPPF, [1024, 5]]          # 11

# # Head configuration
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
#   - [[-1, 8], 1, Concat, [1]]                     # 13
#   - [-1, 3, C2f, [512]]                           # 14
#   - [-1, 1, SwinBlock, [128]]                     # 15

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
#   - [[-1, 4], 1, Concat, [1]]                     # 17
#   - [-1, 3, C2f, [256]]                           # 18
#   - [-1, 1, SwinBlock, [64]]                      # 19

#   - [-1, 1, Conv, [256, 3, 2]]                    # 20
#   - [[-1, 15], 1, Concat, [1]]                    # 21
#   - [-1, 3, C2f, [128]]                           # 22

#   - [-1, 1, Conv, [512, 3, 2]]                    # 23
#   - [[-1, 10], 1, Concat, [1]]                    # 24
#   - [-1, 3, C2f, [1024]]                          # 25

#   - [[19, 22, 25], 1, Detect, [nc]]              # 26



#========================================================
# nc: 1  # Number of classes

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone with CBAM at P4 and P5
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C2f, [512, True]]         # 6
#   - [-1, 1, CBAM, []]                 # 7 - CBAM after P4
#   - [-1, 1, SwinBlock, [128]]         # 8 - SwinBlock with 512 channels
#   - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 10
#   - [-1, 1, CBAM, []]                 # 11 - CBAM after P5
#   - [-1, 1, SPPF, [1024, 5]]          # 12

# # Head configuration
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13
#   - [[-1, 8], 1, Concat, [1]]                     # 14
#   - [-1, 3, C2f, [512]]                           # 15
#   - [-1, 1, CBAM, []]                             # 16 - CBAM before SwinBlock
#   - [-1, 1, SwinBlock, [128]]                     # 17 - Ensure 512 channels for SwinBlock

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 18
#   - [[-1, 4], 1, Concat, [1]]                     # 19
#   - [-1, 3, C2f, [256]]                           # 20
#   - [-1, 1, CBAM, []]                             # 21 - CBAM before SwinBlock
#   - [-1, 1, SwinBlock, [64]]                      # 22 - SwinBlock with 256 channels

#   - [-1, 1, Conv, [256, 3, 2]]                    # 23
#   - [[-1, 17], 1, Concat, [1]]                    # 24
#   - [-1, 3, C2f, [128]]                           # 25

#   - [-1, 1, Conv, [512, 3, 2]]                    # 26
#   - [[-1, 11], 1, Concat, [1]]                    # 27
#   - [-1, 3, C2f, [1024]]                          # 28

#   - [[22, 25, 28], 1, Detect, [nc]]              # 29 - Detection head


#=========================CoordAttention=============================== 

# model.yaml
# Number of classes
# nc: 1

# # Scales
# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
#   - [-1, 3, C2f, [128, True]]         # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
#   - [-1, 6, C2f, [256, True]]         # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
#   - [-1, 6, C2f, [512, True]]         # 6
#   - [-1, 1, CBAM, []]                 # 7 - CBAM after P4
#   - [-1, 1, SwinBlock, [128]]         # 8 - SwinBlock after CBAM (512 channels)
#   - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
#   - [-1, 3, C2f, [1024, True]]        # 10
#   # CBAM at P5 is removed
#   - [-1, 1, SPPF, [1024, 5]]          # 11

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
#   - [[-1, 8], 1, Concat, [1]]                     # 13
#   - [-1, 3, C2f, [512]]                           # 14
#   - [-1, 1, CoordAttention, [128]]                # 15 - NEW: CoordAttention before SwinBlock
#   - [-1, 1, SwinBlock, [128]]                     # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 17
#   - [[-1, 4], 1, Concat, [1]]                     # 18
#   - [-1, 3, C2f, [256]]                           # 19
#   - [-1, 1, CoordAttention, [64]]                # 20 - NEW: CoordAttention before SwinBlock
#   - [-1, 1, SwinBlock, [64]]                      # 21

#   - [-1, 1, Conv, [256, 3, 2]]                    # 22
#   - [[-1, 16], 1, Concat, [1]]                    # 23
#   - [-1, 3, C2f, [128]]                           # 24

#   - [-1, 1, Conv, [512, 3, 2]]                    # 25
#   - [[-1, 11], 1, Concat, [1]]                    # 26
#   - [-1, 3, C2f, [1024]]                          # 27

#   - [[21, 24, 27], 1, Detect, [nc]]               # 28 - Final detection head


#=======================================================================GAM

# # YOLOv8 model with GAM (Global Attention Mechanism)

# nc: 1  # number of classes

# scales:
#   n: [0.33, 0.25, 1024]
#   s: [0.33, 0.50, 1024]
#   m: [0.67, 0.75, 768]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.25, 512]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]        # 0 P1/2
#   - [-1, 1, Conv, [128, 3, 2]]       # 1 P2/4
#   - [-1, 3, C2f, [128, True]]        # 2
#   - [-1, 1, Conv, [256, 3, 2]]       # 3 P3/8
#   - [-1, 6, C2f, [256, True]]        # 4
#   - [-1, 1, GAM, []]                 # 5 GAM at P3
#   - [-1, 1, Conv, [512, 3, 2]]       # 6 P4/16
#   - [-1, 6, C2f, [512, True]]        # 7
#   - [-1, 1, GAM, []]                 # 8 GAM at P4
#   - [-1, 1, Conv, [1024, 3, 2]]      # 9 P5/32
#   - [-1, 3, C2f, [1024, True]]       # 10
#   - [-1, 1, GAM, []]                 # 11 GAM at P5
#   - [-1, 1, SPPF, [1024, 5]]         # 12

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
#   - [[-1, 8], 1, Concat, [1]]                   # 14
#   - [-1, 3, C2f, [512]]                         # 15
#   - [-1, 1, GAM, []]                            # 16 GAM at head stage

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
#   - [[-1, 4], 1, Concat, [1]]                   # 18
#   - [-1, 3, C2f, [256]]                         # 19
#   - [-1, 1, GAM, []]                            # 20 GAM at head stage

#   - [-1, 1, Conv, [256, 3, 2]]                  # 21
#   - [[-1, 15], 1, Concat, [1]]                  # 22
