# # Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# # Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# # Model docs: https://docs.ultralytics.com/models/yolo11
# # Task docs: https://docs.ultralytics.com/tasks/detect

# # Parameters
# nc: 80 # number of classes
# scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
#   # [depth, width, max_channels]
#   n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
#   s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
#   m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
#   l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
#   x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# # YOLO11n backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#   - [-1, 2, C3k2, [256, False, 0.25]]
#   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]]
#   - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
#   - [-1, 2, C3k2, [512, True]]
#   - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
#   - [-1, 2, C3k2, [1024, True]]
#   - [-1, 1, SPPF, [1024, 5]] # 9
#   - [-1, 2, C2PSA, [1024]] # 10

# # YOLO11n head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#   - [-1, 2, C3k2, [512, False]] # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#   - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 13], 1, Concat, [1]] # cat head P4
#   - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 10], 1, Concat, [1]] # cat head P5
#   - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)
#   - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 object detection model with P2/4 - P5/32 outputs

# Parameters
# nc: 1  # à adapter selon ton nombre de classes (ex: 1 pour "tumeur")


# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4 ✅
#   - [-1, 2, C3k2, [256, False, 0.25]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]]  # 4
#   - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
#   - [-1, 2, C3k2, [512, True]]         # 6
#   - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
#   - [-1, 2, C3k2, [1024, True]]        # 8
#   - [-1, 1, SPPF, [1024, 5]]           # 9
#   - [-1, 2, C2PSA, [1024]]             # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
#   - [[-1, 6], 1, Concat, [1]]                  # 12
#   - [-1, 2, C3k2, [512, False]]                # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
#   - [[-1, 4], 1, Concat, [1]]                  # 15
#   - [-1, 2, C3k2, [256, False]]                # 16 (P3/8)

#   - [-1, 1, Conv, [256, 3, 2]]                 # 17
#   - [[-1, 13], 1, Concat, [1]]                 # 18
#   - [-1, 2, C3k2, [512, False]]                # 19 (P4/16)

#   - [-1, 1, Conv, [512, 3, 2]]                 # 20
#   - [[-1, 10], 1, Concat, [1]]                 # 21
#   - [-1, 2, C3k2, [1024, True]]               # 22 (P5/32)

#   - [16, 1, nn.Upsample, [None, 2, "nearest"]] # 23
#   - [[-1, 1], 1, Concat, [1]]                  # 24 (concat P2)
#   - [-1, 2, C3k2, [128, False]]                # 25 (P2/4 - new head)

#   - [[25, 16, 19, 22], 1, Detect, [nc]]        # Final detection head (P2 → P5)


# # YOLO11 modifié pour détection de tumeurs (petits objets)
# nc: 1  # nombre de classes (modifie selon ton dataset)

# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1 - P2/4
#   - [-1, 3, C3k2, [256, False, 0.25]] #  ici 3 repeats (au lieu de 2)
#   - [-1, 1, Conv, [256, 3, 2]]        # 3 - P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]]
#   - [-1, 1, Conv, [512, 3, 2]]        # 5 - P4/16
#   - [-1, 2, C3k2, [512, True]]
#   - [-1, 1, Conv, [1024, 3, 2]]       # 7 - P5/32
#   - [-1, 2, C3k2, [1024, True]]
#   - [-1, 1, SPPF, [1024, 5]]          # 9
#   - [-1, 2, C2PSA, [1024]]            # 10

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]]         # P4
#   - [-1, 2, C3k2, [512, False]]       # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]]         # P3
#   - [-1, 2, C3k2, [256, False]]       # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
#   - [[-1, 1], 1, Concat, [1]]         #  ajout P2
#   - [-1, 2, C3k2, [128, False]]       # 19 - (P2/4 - très petit)

#   - [-1, 1, Conv, [128, 3, 2]]
#   - [[-1, 16], 1, Concat, [1]]
#   - [-1, 2, C3k2, [256, False]]       # 22 - (P3/8)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 13], 1, Concat, [1]]
#   - [-1, 2, C3k2, [512, False]]       # 25 - (P4/16)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 10], 1, Concat, [1]]
#   - [-1, 2, C3k2, [1024, True]]       # 28 - (P5/32)

#   - [[19, 22, 25, 28], 1, Detect, [nc]]  # 4 têtes de détection maintenant


# YOLO11 optimisé pour tumeurs petites (P1/2 à P5/32)

# YOLO11 personnalisé pour détection médicale (tumeur)
# Résolutions : P1/2 (320x320), P2/4, P3/8, P4/16, P5/32
# Compatible Ultralytics + détection petites tailles

# Nombre de classes
# nc: 1  # "tumeur"

# # Scales
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2 (320x320)
#   - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4 (160x160)
#   - [-1, 2, C3k2, [256, False, 0.25]]   # 2
#   - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8 (80x80)
#   - [-1, 2, C3k2, [512, False, 0.25]]   # 4
#   - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16 (40x40)
#   - [-1, 2, C3k2, [512, True]]          # 6
#   - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32 (20x20)
#   - [-1, 2, C3k2, [1024, True]]         # 8
#   - [-1, 1, SPPF, [1024, 5]]            # 9
#   - [-1, 2, C2PSA, [1024]]              # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # P5 → P4
#   - [[-1, 6], 1, Concat, [1]]                    # 12
#   - [-1, 2, C3k2, [512, False]]                  # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # P4 → P3
#   - [[-1, 4], 1, Concat, [1]]                    # 15
#   - [-1, 2, C3k2, [256, False]]                  # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # P3 → P2
#   - [[-1, 1], 1, Concat, [1]]                    # 18
#   - [-1, 2, C3k2, [128, False]]                  # 19

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # P2 → P1
#   - [[-1, 0], 1, Concat, [1]]                    # 21
#   - [-1, 2, C3k2, [64, False]]                   # 22

#   # Downsamples vers P2/P3/P4/P5
#   - [-1, 1, Conv, [64, 3, 2]]                    # 23
#   - [[-1, 19], 1, Concat, [1]]                   # 24
#   - [-1, 2, C3k2, [128, False]]                  # 25

#   - [-1, 1, Conv, [128, 3, 2]]                   # 26
#   - [[-1, 16], 1, Concat, [1]]                   # 27
#   - [-1, 2, C3k2, [256, False]]                  # 28

#   - [-1, 1, Conv, [256, 3, 2]]                   # 29
#   - [[-1, 13], 1, Concat, [1]]                   # 30
#   - [-1, 2, C3k2, [512, False]]                  # 31

#   - [-1, 1, Conv, [512, 3, 2]]                   # 32
#   - [[-1, 10], 1, Concat, [1]]                   # 33
#   - [-1, 2, C3k2, [1024, True]]                  # 34

#   # Detection sur P1, P2, P3, P4, P5
#   - [[22, 25, 28, 31, 34], 1, Detect, [nc]]

# Ultralytics YOLO11 Modified for Small Tumor Detection
# Parameters # number of classes (just tumors)
# scales:
#   # [depth, width, max_channels]
#   medical: [1.00, 1.25, 768]  # Enhanced model for medical imaging

# Modified backbone with increased resolution preservation
# Ultralytics YOLO configuration for small tumor detection
# Optimized for medical imaging with improved precision/recall and mAP



# YOLOv11 - Version deep pour détection de petites tumeurs
# Inclut 4 branches Detect + mix C3k2/RepNCSPELAN4

# Ultralytics YOLO11n custom for small object detection (added P2/4 output)

# Parameters
# Ultralytics YOLO11n custom for small object detection (P2/4 added and fixed)

# Parameters
# Ultralytics YOLO11n custom for small object detection (P2/4 added and fixed)

# Parameters
# nc: 80  # nombre de classes (à adapter pour les tumeurs)
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]             # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]            # 1 - P2/4
#   - [-1, 2, C3k2, [128, False]]           # 2 - P2 amélioré
#   - [-1, 1, Conv, [256, 3, 2]]            # 3 - P3/8
#   - [-1, 2, C3k2, [256, False, 0.25]]     # 4
#   - [-1, 1, Conv, [512, 3, 2]]            # 5 - P4/16
#   - [-1, 2, C3k2, [512, True]]            # 6
#   - [-1, 1, Conv, [1024, 3, 2]]           # 7 - P5/32
#   - [-1, 2, C3k2, [1024, True]]           # 8
#   - [-1, 1, SPPF, [1024, 5]]              # 9
#   - [-1, 2, C2PSA, [1024]]                # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 - up from P5/32 → P4
#   - [[-1, 6], 1, Concat, [1]]                   # 12 - cat avec P4
#   - [-1, 2, C3k2, [512, False]]                 # 13 - P4/16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 - up vers P3
#   - [[-1, 4], 1, Concat, [1]]                   # 15 - cat avec P3
#   - [-1, 2, C3k2, [256, False]]                 # 16 - P3/8

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17 - up vers P2
#   - [2, 1, nn.Identity, []]                     # 18 - P2 déjà à 1/4
#   - [[17, 18], 1, Concat, [1]]                  # 19 - cat head up + P2
#   - [-1, 2, C3k2, [128, False]]                 # 20 - P2/4 output (petits objets)

#   - [16, 1, Conv, [256, 3, 2]]                  # 21 - down to P4
#   - [[-1, 13], 1, Concat, [1]]                  # 22 - cat avec P4
#   - [-1, 2, C3k2, [512, False]]                 # 23 - P4/16

#   - [-1, 1, Conv, [512, 3, 2]]                  # 24 - down to P5
#   - [[-1, 10], 1, Concat, [1]]                  # 25 - cat avec P5
#   - [-1, 2, C3k2, [1024, True]]                 # 26 - P5/32

#   - [[20, 23, 26], 1, Detect, [nc]]             # Detect: P2/4, P4/16, P5/32
# Nombre de classes (ajuste si nécessaire)
# nc: 1  # une seule classe "tumor"

# # Résolutions d'entrée améliorées pour plus de détails (notamment sur petits objets)
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 1024]
#   l: [1.00, 1.00, 1024]
#   x: [1.00, 1.50, 1024]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]              # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]             # 1 - P2/4
#   - [-1, 3, C3k2, [128, False]]            # 2 - plus de profondeur sur P2
#   - [-1, 1, Conv, [256, 3, 2]]             # 3 - P3/8
#   - [-1, 3, C3k2, [256, False, 0.25]]      # 4 - renforcement des détails
#   - [-1, 1, Conv, [512, 3, 2]]             # 5 - P4/16
#   - [-1, 2, C3k2, [512, True]]             # 6
#   - [-1, 1, Conv, [1024, 3, 2]]            # 7 - P5/32
#   - [-1, 2, C3k2, [1024, True]]            # 8
#   - [-1, 1, SPPF, [1024, 5]]               # 9
#   - [-1, 2, C2PSA, [1024]]                 # 10 - attention modifiée

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 - up de P5 vers P4
#   - [[-1, 6], 1, Concat, [1]]                   # 12 - concat avec P4
#   - [-1, 2, C3k2, [512, False]]                 # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 - up vers P3
#   - [[-1, 4], 1, Concat, [1]]                   # 15 - concat avec P3
#   - [-1, 2, C3k2, [256, False]]                 # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17 - up vers P2
#   - [2, 1, nn.Identity, []]                     # 18 - P2
#   - [[17, 18], 1, Concat, [1]]                  # 19 - fusion small object
#   - [-1, 3, C3k2, [128, False]]                 # 20 - sortie petits objets P2/4

#   - [16, 1, Conv, [256, 3, 2]]                  # 21 - down vers P4
#   - [[-1, 13], 1, Concat, [1]]                  # 22
#   - [-1, 2, C3k2, [512, False]]                 # 23

#   - [-1, 1, Conv, [512, 3, 2]]                  # 24 - down vers P5
#   - [[-1, 10], 1, Concat, [1]]                  # 25
#   - [-1, 2, C3k2, [1024, True]]                 # 26

#   # Détection sur 3 échelles, y compris P2 pour petits objets
#   - [[16, 19, 26], 1, Detect, [nc]]


# # Ultralytics YOLOv11 - modèle optimisé pour détection de tumeurs
# nc: 1  # ← Change ici selon ton nombre de classes

# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 1024]
#   l: [1.00, 1.00, 1024]
#   x: [1.00, 1.50, 1024]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0  P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1  P2/4
#   - [-1, 2, C3k2, [256, False, 0.25]] # 2
#   - [-1, 1, Conv, [256, 3, 2]]        # 3  P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]] # 4
#   - [-1, 1, Conv, [512, 3, 2]]        # 5  P4/16
#   - [-1, 2, C3k2, [512, True]]        # 6
#   - [-1, 1, Conv, [1024, 3, 2]]       # 7  P5/32
#   - [-1, 2, C3k2, [1024, True]]       # 8
#   - [-1, 1, SPPF, [1024, 5]]          # 9
#   - [-1, 2, C2PSA, [1024]]            # 10

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 11
#   - [[-1, 6], 1, Concat, [1]]                     # 12
#   - [-1, 2, C3k2, [512, False]]                   # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 14
#   - [[-1, 4], 1, Concat, [1]]                     # 15
#   - [-1, 2, C3k2, [256, False]]                   # 16 ← P3/8

#   # Ajout P2/4 (détection très petits objets)
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 17
#   - [[-1, 2], 1, Concat, [1]]                     # 18 ← concat P2
#   - [-1, 1, C3k2, [128, False]]                   # 19 ← P2/4

#   - [-1, 1, Conv, [128, 3, 2]]                    # 20
#   - [[-1, 16], 1, Concat, [1]]                    # 21
#   - [-1, 2, C3k2, [256, False]]                   # 22 ← P3/8 again

#   - [-1, 1, Conv, [256, 3, 2]]                    # 23
#   - [[-1, 13], 1, Concat, [1]]                    # 24
#   - [-1, 2, C3k2, [512, False]]                   # 25 ← P4/16

#   - [-1, 1, Conv, [512, 3, 2]]                    # 26
#   - [[-1, 10], 1, Concat, [1]]                    # 27
#   - [-1, 2, C3k2, [1024, True]]                   # 28 ← P5/32

#   # Detect : 4 niveaux (P2, P3, P4, P5)
#   - [[19, 22, 25, 28], 1, Detect, [nc]]


# YOLOv11n modifié pour détection fine (tumeurs, petits objets)

# Ultralytics YOLOv11 modified for tumor detection
# Detects at P2 (80x80), P3 (40x40), P4 (20x20), P5 (10x10)
# Deepened model: C3k2 * 4

# nc: 1  # nombre de classes (ex: tumeur)

# scales:
#   n: [2.0, 0.25, 1024]  # profondeur x4 (0.5 * 4)

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]        # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]       # 1 - P2/4
#   - [-1, 4, C3k2, [256, False, 0.25]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]       # 3 - P3/8
#   - [-1, 4, C3k2, [512, False, 0.25]]  # 4
#   - [-1, 1, Conv, [512, 3, 2]]       # 5 - P4/16
#   - [-1, 4, C3k2, [512, True]]        # 6
#   - [-1, 1, Conv, [1024, 3, 2]]      # 7 - P5/32
#   - [-1, 4, C3k2, [1024, True]]       # 8
#   - [-1, 1, SPPF, [1024, 5]]         # 9
#   - [-1, 2, C2PSA, [1024]]           # 10

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 11
#   - [[-1, 6], 1, Concat, [1]]                       # 12
#   - [-1, 4, C3k2, [512, False]]                     # 13 - P4

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 14
#   - [[-1, 4], 1, Concat, [1]]                       # 15
#   - [-1, 4, C3k2, [256, False]]                     # 16 - P3

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 17
#   - [[-1, 2], 1, Concat, [1]]                       # 18
#   - [-1, 4, C3k2, [128, False]]                     # 19 - P2

#   - [[19, 16, 13, 10], 1, Detect, [nc]]             # 20: Detect on P2, P3, P4, P5

# # Nombre de classes (modifie si besoin)
# nc: 1  # tumor

# # Résolutions d'entrée (ajustées pour petits objets)
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 1024]
#   l: [1.00, 1.00, 1024]
#   x: [1.00, 1.50, 1024]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]              # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]             # 1 - P2/4
#   - [-1, 4, C3k2, [128, False]]            # 2
#   - [-1, 1, Conv, [256, 3, 2]]             # 3 - P3/8
#   - [-1, 4, C3k2, [256, False, 0.25]]      # 4
#   - [-1, 1, Conv, [512, 3, 2]]             # 5 - P4/16
#   - [-1, 4, C3k2, [512, True]]             # 6
#   - [-1, 1, Conv, [1024, 3, 2]]            # 7 - P5/32
#   - [-1, 4, C3k2, [1024, True]]            # 8
#   - [-1, 1, SPPF, [1024, 5]]               # 9
#   - [-1, 2, C2PSA, [1024]]                 # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 - P5 -> P4
#   - [[-1, 6], 1, Concat, [1]]                   # 12
#   - [-1, 4, C3k2, [512, False]]                 # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 - P4 -> P3
#   - [[-1, 4], 1, Concat, [1]]                   # 15
#   - [-1, 4, C3k2, [256, False]]                 # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17 - P3 -> P2
#   - [2, 1, nn.Identity, []]                     # 18
#   - [[17, 18], 1, Concat, [1]]                  # 19
#   - [-1, 4, C3k2, [128, False]]                 # 20 ← Première branche P2

#   # ↓↓↓ NOUVELLE BRANCHE P2 ↓↓↓
#   - [20, 1, Conv, [128, 3, 1]]                  # 21
#   - [-1, 1, C3k2, [128, False]]                 # 22 ← Deuxième branche P2 affinée

#   # DOWN P4
#   - [16, 1, Conv, [256, 3, 2]]                  # 23
#   - [[-1, 13], 1, Concat, [1]]                  # 24
#   - [-1, 4, C3k2, [512, False]]                 # 25

#   # DOWN P5
#   - [-1, 1, Conv, [512, 3, 2]]                  # 26
#   - [[-1, 10], 1, Concat, [1]]                  # 27
#   - [-1, 4, C3k2, [1024, True]]                 # 28

#   # Détection à 4 échelles (P2 original + P2 affinée + P3 + P5)
#   - [[20, 22, 16, 28], 1, Detect, [nc]]         # 29

# Nombre de classes
# nc: 1  # tumor

# # Résolutions d'entrée
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 1024]
#   l: [1.00, 1.00, 1024]
#   x: [1.00, 1.50, 1024]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]              # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]             # 1 - P2/4
#   - [-1, 3, C3k2, [128, False]]            # 2
#   - [-1, 1, Conv, [256, 3, 2]]             # 3 - P3/8
#   - [-1, 3, C3k2, [256, False, 0.25]]      # 4
#   - [-1, 1, Conv, [512, 3, 2]]             # 5 - P4/16
#   - [-1, 3, C3k2, [512, True]]             # 6
#   - [-1, 1, Conv, [1024, 3, 2]]            # 7 - P5/32
#   - [-1, 3, C3k2, [1024, True]]            # 8
#   - [-1, 1, SPPF, [1024, 5]]               # 9
#   - [-1, 2, C2PSA, [1024]]                 # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11 - P5 -> P4
#   - [[-1, 6], 1, Concat, [1]]                   # 12
#   - [-1, 3, C3k2, [512, False]]                 # 13 ← P4 fusionnée

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14 - P4 -> P3
#   - [[-1, 4], 1, Concat, [1]]                   # 15
#   - [-1, 3, C3k2, [256, False]]                 # 16 ← P3 fusionnée

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17 - P3 -> P2
#   - [2, 1, nn.Identity, []]                     # 18
#   - [[17, 18], 1, Concat, [1]]                  # 19
#   - [-1, 3, C3k2, [128, False]]                 # 20 ← Première branche P2

#   - [20, 1, Conv, [128, 3, 1]]                  # 21
#   - [-1, 1, C3k2, [128, False]]                 # 22 ← Deuxième branche P2 affinée

#   - [16, 1, Conv, [256, 3, 2]]                  # 23
#   - [[-1, 13], 1, Concat, [1]]                  # 24
#   - [-1, 3, C3k2, [512, False]]                 # 25 ← Nouvelle sortie P4

#   - [[20, 22, 16, 25], 1, Detect, [nc]]         # 26




# Ultralytics YOLO11 object detection model optimized for small objects
# Parameters
nc: 80  # number of classes (adjust to your dataset)
scales:
  # [depth, width, max_channels] - increased width for better small object detection
  n: [0.50, 0.33, 1024]  # increased width from 0.25 to 0.33
  s: [0.50, 0.66, 1024]   # increased width from 0.50 to 0.66
  m: [0.75, 1.00, 512]    # increased depth from 0.50 to 0.75
  l: [1.00, 1.25, 512]    # increased width from 1.00 to 1.25
  x: [1.25, 1.75, 512]    # increased depth and width

# Backbone modifications for better feature extraction
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 1]]  # 0-P1/2 - changed stride from 2 to 1
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]]  # increased repeats from 2 to 3
  - [-1, 1, Conv, [256, 3, 1]] # 3-P3/8 - changed stride from 2 to 1
  - [-1, 3, C3k2, [512, False, 0.25]]  # increased repeats from 2 to 3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 3, C3k2, [512, True]]  # increased repeats from 2 to 3
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3k2, [1024, True]] # increased repeats from 2 to 3
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# Head modifications for better small object detection
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3k2, [512, False]] # 13 - increased repeats from 2 to 3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3k2, [256, False]] # 16 (P3/8-small) - increased repeats from 2 to 3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3k2, [512, False]] # 19 (P4/16-medium) - increased repeats from 2 to 3

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3k2, [1024, True]] # 22 (P5/32-large) - increased repeats from 2 to 3
  
  # Modified Detect layer with additional P2 layer for very small objects
  - [-1, 1, Conv, [128, 3, 2]] # Additional downsampling
  - [[-1, 1], 1, Concat, [1]] # Additional feature fusion
  - [-1, 2, C3k2, [256, False]] # Additional P2 layer
  - [[16, 19, 22, -1], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)