# # Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# # Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# # Model docs: https://docs.ultralytics.com/models/yolo11
# # Task docs: https://docs.ultralytics.com/tasks/detect

# # Parameters
# nc: 80 # number of classes
# scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
#   # [depth, width, max_channels]
#   n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
#   s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
#   m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
#   l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
#   x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# # YOLO11n backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#   - [-1, 2, C3k2, [256, False, 0.25]]
#   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]]
#   - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
#   - [-1, 2, C3k2, [512, True]]
#   - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
#   - [-1, 2, C3k2, [1024, True]]
#   - [-1, 1, SPPF, [1024, 5]] # 9
#   - [-1, 2, C2PSA, [1024]] # 10

# # YOLO11n head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P4
#   - [-1, 2, C3k2, [512, False]] # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#   - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 13], 1, Concat, [1]] # cat head P4
#   - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 10], 1, Concat, [1]] # cat head P5
#   - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)
#   - [[25, 16, 19, 22], 1, Detect, [nc]]            # Detect at 4 scales now (P2-P5)
#   #- [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 object detection model with P2/4 - P5/32 outputs

# Parameters
# nc: 1  # à adapter selon ton nombre de classes (ex: 1 pour "tumeur")


# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4 ✅
#   - [-1, 2, C3k2, [256, False, 0.25]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]]  # 4
#   - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
#   - [-1, 2, C3k2, [512, True]]         # 6
#   - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
#   - [-1, 2, C3k2, [1024, True]]        # 8
#   - [-1, 1, SPPF, [1024, 5]]           # 9
#   - [-1, 2, C2PSA, [1024]]             # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
#   - [[-1, 6], 1, Concat, [1]]                  # 12
#   - [-1, 2, C3k2, [512, False]]                # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
#   - [[-1, 4], 1, Concat, [1]]                  # 15
#   - [-1, 2, C3k2, [256, False]]                # 16 (P3/8)

#   - [-1, 1, Conv, [256, 3, 2]]                 # 17
#   - [[-1, 13], 1, Concat, [1]]                 # 18
#   - [-1, 2, C3k2, [512, False]]                # 19 (P4/16)

#   - [-1, 1, Conv, [512, 3, 2]]                 # 20
#   - [[-1, 10], 1, Concat, [1]]                 # 21
#   - [-1, 2, C3k2, [1024, True]]               # 22 (P5/32)

#   - [16, 1, nn.Upsample, [None, 2, "nearest"]] # 23
#   - [[-1, 1], 1, Concat, [1]]                  # 24 (concat P2)
#   - [-1, 2, C3k2, [128, False]]                # 25 (P2/4 - new head)

#   - [[25, 16, 19, 22], 1, Detect, [nc]]        # Final detection head (P2 → P5)


# # YOLO11 modifié pour détection de tumeurs (petits objets)
# nc: 1  # nombre de classes (modifie selon ton dataset)

# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]         # 0 - P1/2
#   - [-1, 1, Conv, [128, 3, 2]]        # 1 - P2/4
#   - [-1, 3, C3k2, [256, False, 0.25]] #  ici 3 repeats (au lieu de 2)
#   - [-1, 1, Conv, [256, 3, 2]]        # 3 - P3/8
#   - [-1, 2, C3k2, [512, False, 0.25]]
#   - [-1, 1, Conv, [512, 3, 2]]        # 5 - P4/16
#   - [-1, 2, C3k2, [512, True]]
#   - [-1, 1, Conv, [1024, 3, 2]]       # 7 - P5/32
#   - [-1, 2, C3k2, [1024, True]]
#   - [-1, 1, SPPF, [1024, 5]]          # 9
#   - [-1, 2, C2PSA, [1024]]            # 10

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]]         # P4
#   - [-1, 2, C3k2, [512, False]]       # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]]         # P3
#   - [-1, 2, C3k2, [256, False]]       # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
#   - [[-1, 1], 1, Concat, [1]]         #  ajout P2
#   - [-1, 2, C3k2, [128, False]]       # 19 - (P2/4 - très petit)

#   - [-1, 1, Conv, [128, 3, 2]]
#   - [[-1, 16], 1, Concat, [1]]
#   - [-1, 2, C3k2, [256, False]]       # 22 - (P3/8)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 13], 1, Concat, [1]]
#   - [-1, 2, C3k2, [512, False]]       # 25 - (P4/16)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 10], 1, Concat, [1]]
#   - [-1, 2, C3k2, [1024, True]]       # 28 - (P5/32)

#   - [[19, 22, 25, 28], 1, Detect, [nc]]  # 4 têtes de détection maintenant


# YOLO11 optimisé pour tumeurs petites (P1/2 à P5/32)

# YOLO11 personnalisé pour détection médicale (tumeur)
# Résolutions : P1/2 (320x320), P2/4, P3/8, P4/16, P5/32
# Compatible Ultralytics + détection petites tailles

# Nombre de classes
# nc: 1  # "tumeur"

# # Scales
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# # Backbone
# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2 (320x320)
#   - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4 (160x160)
#   - [-1, 2, C3k2, [256, False, 0.25]]   # 2
#   - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8 (80x80)
#   - [-1, 2, C3k2, [512, False, 0.25]]   # 4
#   - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16 (40x40)
#   - [-1, 2, C3k2, [512, True]]          # 6
#   - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32 (20x20)
#   - [-1, 2, C3k2, [1024, True]]         # 8
#   - [-1, 1, SPPF, [1024, 5]]            # 9
#   - [-1, 2, C2PSA, [1024]]              # 10

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # P5 → P4
#   - [[-1, 6], 1, Concat, [1]]                    # 12
#   - [-1, 2, C3k2, [512, False]]                  # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # P4 → P3
#   - [[-1, 4], 1, Concat, [1]]                    # 15
#   - [-1, 2, C3k2, [256, False]]                  # 16

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # P3 → P2
#   - [[-1, 1], 1, Concat, [1]]                    # 18
#   - [-1, 2, C3k2, [128, False]]                  # 19

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # P2 → P1
#   - [[-1, 0], 1, Concat, [1]]                    # 21
#   - [-1, 2, C3k2, [64, False]]                   # 22

#   # Downsamples vers P2/P3/P4/P5
#   - [-1, 1, Conv, [64, 3, 2]]                    # 23
#   - [[-1, 19], 1, Concat, [1]]                   # 24
#   - [-1, 2, C3k2, [128, False]]                  # 25

#   - [-1, 1, Conv, [128, 3, 2]]                   # 26
#   - [[-1, 16], 1, Concat, [1]]                   # 27
#   - [-1, 2, C3k2, [256, False]]                  # 28

#   - [-1, 1, Conv, [256, 3, 2]]                   # 29
#   - [[-1, 13], 1, Concat, [1]]                   # 30
#   - [-1, 2, C3k2, [512, False]]                  # 31

#   - [-1, 1, Conv, [512, 3, 2]]                   # 32
#   - [[-1, 10], 1, Concat, [1]]                   # 33
#   - [-1, 2, C3k2, [1024, True]]                  # 34

#   # Detection sur P1, P2, P3, P4, P5
#   - [[22, 25, 28, 31, 34], 1, Detect, [nc]]

# Ultralytics YOLO11 Modified for Small Tumor Detection
# Parameters # number of classes (just tumors)
# scales:
#   # [depth, width, max_channels]
#   medical: [1.00, 1.25, 768]  # Enhanced model for medical imaging

# Modified backbone with increased resolution preservation
# Ultralytics YOLO configuration for small tumor detection
# Optimized for medical imaging with improved precision/recall and mAP



# YOLOv11 - Version deep pour détection de petites tumeurs
# Inclut 4 branches Detect + mix C3k2/RepNCSPELAN4

nc: 1  # Nombre de classes (1 = tumeur)

scales:
  deep: [0.75, 0.75, 1024]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, RepNCSPELAN4, [512]]    # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, RepNCSPELAN4, [1024]]   # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 2, C2PSA, [1024]]          # 10

# Head - 4 branches de détection
head:
  # P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 11
  - [[-1, 6], 1, Concat, [1]]                     # 12
  - [-1, 2, RepNCSPELAN4, [512]]                  # 13

  # P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15
  - [-1, 2, C3k2, [256, False]]                   # 16

  # P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 17
  - [[-1, 2], 1, Concat, [1]]                     # 18
  - [-1, 2, C3k2, [128, False]]                   # 19

  # Down P3
  - [-1, 1, Conv, [128, 3, 2]]                    # 20
  - [[-1, 16], 1, Concat, [1]]                    # 21
  - [-1, 2, C3k2, [256, False]]                   # 22

  # Down P4
  - [-1, 1, Conv, [256, 3, 2]]                    # 23
  - [[-1, 13], 1, Concat, [1]]                    # 24
  - [-1, 2, RepNCSPELAN4, [512]]                  # 25

  # Down P5
  - [-1, 1, Conv, [512, 3, 2]]                    # 26
  - [[-1, 10], 1, Concat, [1]]                    # 27
  - [-1, 2, RepNCSPELAN4, [1024]]                 # 28

  # Detect head
  - [[19, 22, 25, 28], 1, Detect, [nc]]           # 29 - Detect(P2/4, P3/8, P4/16, P5/32)
